; domain
(define (domain no_wall_triggers_domain)

    (:types
        location
        enemy
    )

    (:predicates
        (enemy_loc ?enemy - enemy ?loc - location)
        (con ?from ?to - location)          ; locations are connected
        (wall ?loc1 ?loc2 - location)       ; wall between locations
        (blocked ?loc - location)           ; location is blocked - agent cannot go there
        (goal_tile ?loc - location)
        (goal_reached ?enemy - enemy)
    )

    (:action move
        :parameters (?from ?to - location ?e - enemy)
        :precondition (and (not (blocked ?to)) (or (con ?from ?to) (con ?to ?from)) (enemy_loc ?e ?from) (not (or (wall ?from ?to) (wall ?to ?from))) )
        :effect (and 
            (enemy_loc ?e ?to)
            (not (enemy_loc ?e ?from))
            (when (not (goal_tile ?to)) 
                (blocked ?to)
            )
            (when (goal_tile ?to) 
                (goal_reached ?e)
            )
            (not (blocked ?from))
        )
    )
)

; problem
(define (problem enemy_problem)

    (:domain no_wall_triggers_domain)
    
    (:objects
        a5 b5 c5 d5 e5 
        a4 b4 c4 d4 e4 
        a3 b3 c3 d3 e3 
        a2 b2 c2 d2 e2 
        a1 b1 c1 d1 e1 
         - location
        en1  - enemy
    )
    
    (:init 
        (enemy_loc en1 a5) 
        
        
        

        
        
        ; column connections
        (con a5 a4) (con b5 b4) (con c5 c4) (con d5 d4) (con e5 e4) 
        (con a4 a3) (con b4 b3) (con c4 c3) (con d4 d3) (con e4 e3) 
        (con a3 a2) (con b3 b2) (con c3 c2) (con d3 d2) (con e3 e2) 
        (con a2 a1) (con b2 b1) (con c2 c1) (con d2 d1) (con e2 e1) 
        
        
        
        ; row connections
        (con a5 b5) (con b5 c5) (con c5 d5) (con d5 e5) 
        (con a4 b4) (con b4 c4) (con c4 d4) (con d4 e4) 
        (con a3 b3) (con b3 c3) (con c3 d3) (con d3 e3) 
        (con a2 b2) (con b2 c2) (con c2 d2) (con d2 e2) 
        (con a1 b1) (con b1 c1) (con c1 d1) (con d1 e1) 
        
        
        (blocked a5) 
        
        (wall b3 b2) (wall c3 b3) (wall b1 a1) (wall a2 a1) 

        

        (goal_tile e1) 
    )
    
    (:goal
        (or
          (goal_reached en1)
          )
    )

    (:metric minimize (total-cost))
)

; plan
1. (move a5 a4 en1)
   deleted: (enemy_loc en1 a5) (blocked a5)
   added: (enemy_loc en1 a4) (blocked a4)
   goals met: 0 of 1
2. (move a4 a3 en1)
   deleted: (enemy_loc en1 a4) (blocked a4)
   added: (enemy_loc en1 a3) (blocked a3)
   goals met: 0 of 1
3. (move a3 a2 en1)
   deleted: (enemy_loc en1 a3) (blocked a3)
   added: (enemy_loc en1 a2) (blocked a2)
   goals met: 0 of 1
4. (move a2 b2 en1)
   deleted: (enemy_loc en1 a2) (blocked a2)
   added: (enemy_loc en1 b2) (blocked b2)
   goals met: 0 of 1
5. (move b2 b1 en1)
   deleted: (enemy_loc en1 b2) (blocked b2)
   added: (enemy_loc en1 b1) (blocked b1)
   goals met: 0 of 1
6. (move b1 c1 en1)
   deleted: (enemy_loc en1 b1) (blocked b1)
   added: (enemy_loc en1 c1) (blocked c1)
   goals met: 0 of 1
7. (move c1 d1 en1)
   deleted: (enemy_loc en1 c1) (blocked c1)
   added: (enemy_loc en1 d1) (blocked d1)
   goals met: 0 of 1
8. (move d1 e1 en1)
   deleted: (enemy_loc en1 d1) (blocked d1)
   added: (enemy_loc en1 e1) (goal_reached en1)
   goals met: 1 of 1
